Config/Enums/ВидыКБК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКБК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>гКБК</Name>
					<Comment>Глава по БК</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КРБ</Name>
					<Comment>Классификация расходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КДБ</Name>
					<Comment>Классификация доходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КИФ</Name>
					<Comment>Классификация источников финансирования дефицита бюджетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУИБУ</Name>
					<Comment>Для АУ и БУ начиная с 01.01.2017</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ВидыРасходовКРБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыРасходовКРБ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/СтатьиКИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтатьиКИФ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ГруппыПодгруппыКИФ</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеКОСГУ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КОСГУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыДоходовКДБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДоходовКДБ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подгруппа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подстатья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АналитическиеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АналитическаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ЦелевыеСтатьиКРБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЦелевыеСтатьиКРБ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ПрограммыЦелевыхСтатейКРБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПрограммыЦелевыхСтатейКРБ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелеваяСтатья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелевыеСтатьиКРБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/ФоновыеЗаданияБюджетнаяКлассификация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьКомплектВОбщемМодуле(Параметры, АдресВХранилище) Экспорт
	
	ОбрОбъект = Обработки.ПомощникОбновленияБюджетнойКлассификации.Создать();
	
	ОбрОбъект.ДоступныеОбновления.Загрузить(Параметры.ДоступныеОбновления);
	
	Если ТипЗнч(Параметры.АдресХранилища) = Тип("ДвоичныеДанные") Тогда
		ОбрОбъект.Хранение = ПоместитьВоВременноеХранилище(Параметры.АдресХранилища)
	Иначе
		ОбрОбъект.Хранение = Параметры.АдресХранилища;
	КонецЕсли;
	
    ОбрОбъект.ЗагружатьСОшибками = Параметры.ЗагружатьСОшибками;
	ОбрОбъект.ОтменятьЗагрузку = Параметры.ОтменятьЗагрузку;
	
	ОбрОбъект.ЗагрузитьОбновление(Параметры.НомерСтроки);
	ТаблИнф = ОбрОбъект.ТаблицаИнформации.Выгрузить();
	ТаблИнф.Свернуть("ИмяОбъекта,СсылкаНаЭлементОшибки,ОписаниеОшибки,ЗагружаемыеДанные");
	
	СтруктураРезультата = Новый Структура("ТаблицаОшибок,ДанныеДляАктуализацииКПС,ТаблицаИнформации",ОбрОбъект.ТаблицаОшибок.Выгрузить(),ОбрОбъект.ДанныеДляАктуализацииКПС.Выгрузить(),ТаблИнф);
	ПоместитьВоВременноеХранилище(СтруктураРезультата,АдресВХранилище);
	
КонецПроцедуры

Процедура ВыполнитьАктуализациюКПС(Параметры, АдресВХранилище) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяКПС", "КлассификационныеПризнакиСчетов");
	СтруктураПараметров.Вставить("ДатаНачалаДействия", "ДатаНачалаДействия");
	СтруктураПараметров.Вставить("ДатаОкончанияДействия", "ДатаОкончанияДействия");
	СтруктураПараметров.Вставить("ОкончаниеДействия", "ОкончаниеДействия");
	СтруктураПараметров.Вставить("ВидПоказателя", "ВидПоказателя");
	СтруктураПараметров.Вставить("Код", "Код");
	
	БюджетнаяКлассификацияПереопределяемый.ПереопределитьПараметрыАктуализацииКПС(СтруктураПараметров);									
	
	Если ТипЗнч(СтруктураПараметров) <> Тип("Структура") ИЛИ НЕ СтруктураПараметров.Свойство("ИмяКПС") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("ЗагружаемыеДанные", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(200)));
	ТаблицаОшибок.Колонки.Добавить("ИмяОбъекта", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(150)));
	ТаблицаОшибок.Колонки.Добавить("ОписаниеОшибки", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(1000)));
	ТаблицаОшибок.Колонки.Добавить("СсылкаНаЭлементОшибки");
	
	ТаблицаИнформации = Новый ТаблицаЗначений;
	ТаблицаИнформации.Колонки.Добавить("ЗагружаемыеДанные", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(200)));
	ТаблицаИнформации.Колонки.Добавить("ИмяОбъекта", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(150)));
	ТаблицаИнформации.Колонки.Добавить("ОписаниеОшибки", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(1000)));
	ТаблицаИнформации.Колонки.Добавить("СсылкаНаЭлементОшибки");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТабАктуализации", Параметры.ДанныеДляАктуализацииКПС);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабАктуализации.СсылкаНаЭлемент,
	|	ТабАктуализации.ДатаНачалаДействия,
	|	ТабАктуализации.ДатаОкончанияДействия,
	|	ТабАктуализации.ПомеченНаУдаление КАК ПометкаУдаления
	|ПОМЕСТИТЬ ВремТабАкт
	|ИЗ
	|	&ТабАктуализации КАК ТабАктуализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабАкт.СсылкаНаЭлемент,
	|	ВремТабАкт.ДатаНачалаДействия,
	|	ВремТабАкт.ДатаОкончанияДействия,
	|	ВремТабАкт.ПометкаУдаления
	|ПОМЕСТИТЬ СпрВидРасходаКРБ
	|ИЗ
	|	ВремТабАкт КАК ВремТабАкт
	|ГДЕ
	|	ВремТабАкт.СсылкаНаЭлемент ССЫЛКА Справочник.ВидыРасходовКРБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабАкт.СсылкаНаЭлемент,
	|	ВремТабАкт.ДатаНачалаДействия,
	|	ВремТабАкт.ДатаОкончанияДействия,
	|	ВремТабАкт.ПометкаУдаления
	|ПОМЕСТИТЬ СпрСтатьяКИФ
	|ИЗ
	|	ВремТабАкт КАК ВремТабАкт
	|ГДЕ
	|	ВремТабАкт.СсылкаНаЭлемент ССЫЛКА Справочник.СтатьиКИФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабАкт.СсылкаНаЭлемент,
	|	ВремТабАкт.ДатаНачалаДействия,
	|	ВремТабАкт.ДатаОкончанияДействия,
	|	ВремТабАкт.ПометкаУдаления
	|ПОМЕСТИТЬ СпрВидДоходаКДБ
	|ИЗ
	|	ВремТабАкт КАК ВремТабАкт
	|ГДЕ
	|	ВремТабАкт.СсылкаНаЭлемент ССЫЛКА Справочник.ВидыДоходовКДБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабАкт.СсылкаНаЭлемент,
	|	ВремТабАкт.ДатаНачалаДействия,
	|	ВремТабАкт.ДатаОкончанияДействия,
	|	ВремТабАкт.ПометкаУдаления
	|ПОМЕСТИТЬ СпрЦелеваяСтатьяКРБ
	|ИЗ
	|	ВремТабАкт КАК ВремТабАкт
	|ГДЕ
	|	ВремТабАкт.СсылкаНаЭлемент ССЫЛКА Справочник.ЦелевыеСтатьиКРБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабАкт.СсылкаНаЭлемент,
	|	ВремТабАкт.ДатаНачалаДействия,
	|	ВремТабАкт.ДатаОкончанияДействия,
	|	ВремТабАкт.ПометкаУдаления
	|ПОМЕСТИТЬ СпрПрограммаЦелевойСтатьиКРБ
	|ИЗ
	|	ВремТабАкт КАК ВремТабАкт
	|ГДЕ
	|	ВремТабАкт.СсылкаНаЭлемент ССЫЛКА Справочник.ПрограммыЦелевыхСтатейКРБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////  
	|ВЫБРАТЬ
	|	КБК.Ссылка,
	|	КБК."+СтруктураПараметров.ДатаНачалаДействия+" КАК "+СтруктураПараметров.ДатаНачалаДействия+",
	|	КБК."+СтруктураПараметров.ДатаОкончанияДействия+" КАК "+СтруктураПараметров.ДатаОкончанияДействия+",
	|	КБК."+СтруктураПараметров.ВидПоказателя+" КАК ВидКБК,
	|	КБК.УточнениеПоказателя КАК УточнениеПоказателя,
	|	ВЫБОР
	|		КОГДА СпрВидРасходаКРБ.СсылкаНаЭлемент ЕСТЬ NULL 
	|			ТОГДА КБК.ВидРасходаКРБ
	|		ИНАЧЕ СпрВидРасходаКРБ.СсылкаНаЭлемент
	|	КОНЕЦ КАК ВидРасходаКРБ,
	|	ВЫБОР
	|		КОГДА СпрВидРасходаКРБ.ДатаНачалаДействия ЕСТЬ NULL 
	|			ТОГДА КБК.ВидРасходаКРБ.ДатаНачалаДействия
	|		ИНАЧЕ СпрВидРасходаКРБ.ДатаНачалаДействия
	|	КОНЕЦ КАК ВидРасходаКРБДатаНачалаДействия,
	|	ВЫБОР
	|		КОГДА СпрВидРасходаКРБ.ДатаОкончанияДействия ЕСТЬ NULL 
	|			ТОГДА КБК.ВидРасходаКРБ.ДатаОкончанияДействия
	|		ИНАЧЕ СпрВидРасходаКРБ.ДатаОкончанияДействия
	|	КОНЕЦ КАК ВидРасходаКРБДатаОкончанияДействия,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА СпрВидРасходаКРБ.ПометкаУдаления ЕСТЬ NULL 
	|				ТОГДА КБК.ВидРасходаКРБ.ПометкаУдаления
	|			ИНАЧЕ СпрВидРасходаКРБ.ПометкаУдаления
	|		КОНЕЦ, ЛОЖЬ) КАК ВидРасходаКРБПометкаУдаления,
	|	ВЫБОР
	|		КОГДА СпрСтатьяКИФ.СсылкаНаЭлемент ЕСТЬ NULL 
	|			ТОГДА КБК.СтатьяКИФ
	|		ИНАЧЕ СпрСтатьяКИФ.СсылкаНаЭлемент
	|	КОНЕЦ КАК СтатьяКИФ,
	|	ВЫБОР
	|		КОГДА СпрСтатьяКИФ.ДатаНачалаДействия ЕСТЬ NULL 
	|			ТОГДА КБК.СтатьяКИФ.ДатаНачалаДействия
	|		ИНАЧЕ СпрСтатьяКИФ.ДатаНачалаДействия
	|	КОНЕЦ КАК СтатьяКИФДатаНачалаДействия,
	|	ВЫБОР
	|		КОГДА СпрСтатьяКИФ.ДатаОкончанияДействия ЕСТЬ NULL 
	|			ТОГДА КБК.СтатьяКИФ.ДатаОкончанияДействия
	|		ИНАЧЕ СпрСтатьяКИФ.ДатаОкончанияДействия
	|	КОНЕЦ КАК СтатьяКИФДатаОкончанияДействия,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА СпрСтатьяКИФ.ПометкаУдаления ЕСТЬ NULL 
	|				ТОГДА КБК.СтатьяКИФ.ПометкаУдаления
	|			ИНАЧЕ СпрСтатьяКИФ.ПометкаУдаления
	|		КОНЕЦ, ЛОЖЬ) КАК СтатьяКИФПометкаУдаления,
	|	ВЫБОР
	|		КОГДА СпрВидДоходаКДБ.СсылкаНаЭлемент ЕСТЬ NULL 
	|			ТОГДА КБК.ВидДоходаКДБ
	|		ИНАЧЕ СпрВидДоходаКДБ.СсылкаНаЭлемент
	|	КОНЕЦ КАК ВидДоходаКДБ,
	|	ВЫБОР
	|		КОГДА СпрВидДоходаКДБ.ДатаНачалаДействия ЕСТЬ NULL 
	|			ТОГДА КБК.ВидДоходаКДБ.ДатаНачалаДействия
	|		ИНАЧЕ СпрВидДоходаКДБ.ДатаНачалаДействия
	|	КОНЕЦ КАК ВидДоходаКДБДатаНачалаДействия,
	|	ВЫБОР
	|		КОГДА СпрВидДоходаКДБ.ДатаОкончанияДействия ЕСТЬ NULL 
	|			ТОГДА КБК.ВидДоходаКДБ.ДатаОкончанияДействия
	|		ИНАЧЕ СпрВидДоходаКДБ.ДатаОкончанияДействия
	|	КОНЕЦ КАК ВидДоходаКДБДатаОкончанияДействия,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА СпрВидДоходаКДБ.ПометкаУдаления ЕСТЬ NULL 
	|				ТОГДА КБК.ВидДоходаКДБ.ПометкаУдаления
	|			ИНАЧЕ СпрВидДоходаКДБ.ПометкаУдаления
	|		КОНЕЦ, ЛОЖЬ) КАК ВидДоходаКДБПометкаУдаления,
	|	ВЫБОР
	|		КОГДА СпрЦелеваяСтатьяКРБ.СсылкаНаЭлемент ЕСТЬ NULL 
	|			ТОГДА КБК.ЦелеваяСтатьяКРБ
	|		ИНАЧЕ СпрЦелеваяСтатьяКРБ.СсылкаНаЭлемент
	|	КОНЕЦ КАК ЦелеваяСтатьяКРБ,
	|	ВЫБОР
	|		КОГДА СпрЦелеваяСтатьяКРБ.ДатаНачалаДействия ЕСТЬ NULL 
	|			ТОГДА КБК.ЦелеваяСтатьяКРБ.ДатаНачалаДействия
	|		ИНАЧЕ СпрЦелеваяСтатьяКРБ.ДатаНачалаДействия
	|	КОНЕЦ КАК ЦелеваяСтатьяКРБДатаНачалаДействия,
	|	ВЫБОР
	|		КОГДА СпрЦелеваяСтатьяКРБ.ДатаОкончанияДействия ЕСТЬ NULL 
	|			ТОГДА КБК.ЦелеваяСтатьяКРБ.ДатаОкончанияДействия
	|		ИНАЧЕ СпрЦелеваяСтатьяКРБ.ДатаОкончанияДействия
	|	КОНЕЦ КАК ЦелеваяСтатьяКРБДатаОкончанияДействия,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА СпрЦелеваяСтатьяКРБ.ПометкаУдаления ЕСТЬ NULL 
	|				ТОГДА КБК.ЦелеваяСтатьяКРБ.ПометкаУдаления
	|			ИНАЧЕ СпрЦелеваяСтатьяКРБ.ПометкаУдаления
	|		КОНЕЦ, ЛОЖЬ) КАК ЦелеваяСтатьяКРБПометкаУдаления,
	|	ВЫБОР
	|		КОГДА СпрПрограммаЦелевойСтатьиКРБ.СсылкаНаЭлемент ЕСТЬ NULL 
	|			ТОГДА КБК.ПрограммаЦелевойСтатьиКРБ
	|		ИНАЧЕ СпрПрограммаЦелевойСтатьиКРБ.СсылкаНаЭлемент
	|	КОНЕЦ КАК ПрограммаЦелевойСтатьиКРБ,
	|	ВЫБОР
	|		КОГДА СпрПрограммаЦелевойСтатьиКРБ.ДатаНачалаДействия ЕСТЬ NULL 
	|			ТОГДА КБК.ПрограммаЦелевойСтатьиКРБ.ДатаНачалаДействия
	|		ИНАЧЕ СпрПрограммаЦелевойСтатьиКРБ.ДатаНачалаДействия
	|	КОНЕЦ КАК ПрограммаЦелевойСтатьиКРБДатаНачалаДействия,
	|	ВЫБОР
	|		КОГДА СпрПрограммаЦелевойСтатьиКРБ.ДатаОкончанияДействия ЕСТЬ NULL 
	|			ТОГДА КБК.ПрограммаЦелевойСтатьиКРБ.ДатаОкончанияДействия
	|		ИНАЧЕ СпрПрограммаЦелевойСтатьиКРБ.ДатаОкончанияДействия
	|	КОНЕЦ КАК ПрограммаЦелевойСтатьиКРБДатаОкончанияДействия,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА СпрПрограммаЦелевойСтатьиКРБ.ПометкаУдаления ЕСТЬ NULL 
	|				ТОГДА КБК.ПрограммаЦелевойСтатьиКРБ.ПометкаУдаления
	|			ИНАЧЕ СпрПрограммаЦелевойСтатьиКРБ.ПометкаУдаления
	|		КОНЕЦ, ЛОЖЬ) КАК ПрограммаЦелевойСтатьиКРБПометкаУдаления
	|ИЗ
	|	Справочник."+СтруктураПараметров.ИмяКПС+" КАК КБК
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрВидРасходаКРБ КАК СпрВидРасходаКРБ
	|		ПО КБК.ВидРасходаКРБ = СпрВидРасходаКРБ.СсылкаНаЭлемент
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрСтатьяКИФ КАК СпрСтатьяКИФ
	|		ПО КБК.СтатьяКИФ = СпрСтатьяКИФ.СсылкаНаЭлемент
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрВидДоходаКДБ КАК СпрВидДоходаКДБ
	|		ПО КБК.ВидДоходаКДБ = СпрВидДоходаКДБ.СсылкаНаЭлемент
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрЦелеваяСтатьяКРБ КАК СпрЦелеваяСтатьяКРБ
	|		ПО КБК.ЦелеваяСтатьяКРБ = СпрЦелеваяСтатьяКРБ.СсылкаНаЭлемент
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрПрограммаЦелевойСтатьиКРБ КАК СпрПрограммаЦелевойСтатьиКРБ
	|		ПО КБК.ПрограммаЦелевойСтатьиКРБ = СпрПрограммаЦелевойСтатьиКРБ.СсылкаНаЭлемент
	|ГДЕ
	|	КБК.ПометкаУдаления = ЛОЖЬ";
	
	Если  Метаданные.Справочники[СтруктураПараметров.ИмяКПС].Иерархический
		И Метаданные.Справочники[СтруктураПараметров.ИмяКПС].ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И КБК.ЭтоГруппа = ЛОЖЬ";
		
	КонецЕсли;	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ЗначениеЗаполнениеДаты = Метаданные.Справочники[СтруктураПараметров.ИмяКПС].Реквизиты[СтруктураПараметров.ДатаОкончанияДействия].ЗначениеЗаполнения;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СпрКБКОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		СпрКБКОбъект[СтруктураПараметров.Код] = ПлановыеПоказателиДеятельности.СформироватьНовыйКодСтатьи(ПлановыеПоказателиДеятельности.ОбъектВСтруктуру(СпрКБКОбъект), ВыборкаДетальныеЗаписи.ВидКБК, ВыборкаДетальныеЗаписи.УточнениеПоказателя);
		
		СпрКБКОбъект.ОбменДанными.Загрузка = Истина;
		СпрКБКОбъект.ДополнительныеСвойства.Вставить("НеОбрабатывать");   //чтобы не обрабатывались подписки на изменение флага ЭлементГруппа
		ВидКБК = ВыборкаДетальныеЗаписи.ВидКБК;
		
		Если ВидКБК = Перечисления.ВидыКБК.КДБ Тогда
			УстановитьПериодДействияПоОбщемуПериодуДействияКомпонентов("ВидДоходаКДБ", СпрКБКОбъект, ВыборкаДетальныеЗаписи, ТаблицаИнформации, СтруктураПараметров);
		ИначеЕсли ВидКБК = Перечисления.ВидыКБК.КРБ Тогда
			УстановитьПериодДействияПоОбщемуПериодуДействияКомпонентов("ЦелеваяСтатьяКРБ,ПрограммаЦелевойСтатьиКРБ,ВидРасходаКРБ", СпрКБКОбъект, ВыборкаДетальныеЗаписи, ТаблицаИнформации, СтруктураПараметров);
		ИначеЕсли ВидКБК = Перечисления.ВидыКБК.КИФ Тогда
			УстановитьПериодДействияПоОбщемуПериодуДействияКомпонентов("СтатьяКИФ", СпрКБКОбъект, ВыборкаДетальныеЗаписи, ТаблицаИнформации, СтруктураПараметров);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СпрКБКОбъект[СтруктураПараметров.ОкончаниеДействия]) Тогда
			СпрКБКОбъект[СтруктураПараметров.ДатаОкончанияДействия] = СпрКБКОбъект[СтруктураПараметров.ОкончаниеДействия];
		Иначе
			СпрКБКОбъект[СтруктураПараметров.ДатаОкончанияДействия] = ЗначениеЗаполнениеДаты;
		КонецЕсли;
		
		ИзмененПериодДействия = СпрКБКОбъект[СтруктураПараметров.ДатаНачалаДействия] <> ВыборкаДетальныеЗаписи[СтруктураПараметров.ДатаНачалаДействия] ИЛИ СпрКБКОбъект[СтруктураПараметров.ДатаОкончанияДействия] <> ВыборкаДетальныеЗаписи[СтруктураПараметров.ДатаОкончанияДействия];
		
		Если ВидКБК = Перечисления.ВидыКБК.КРБ Тогда
			//Заполним код и наименование целевой статьи
			Справочники[СтруктураПараметров.ИмяКПС].УстановитьПолныйКодЦелевойСтатьи(СпрКБКОбъект.КодЦелевойСтатьи, СпрКБКОбъект.НаименованиеЦелевойСтатьи, СпрКБКОбъект.ЦелеваяСтатьяКРБ, 
			СпрКБКОбъект.ПрограммаЦелевойСтатьиКРБ, СпрКБКОбъект[СтруктураПараметров.ДатаНачалаДействия]);
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ЦелеваяСтатьяКРБПометкаУдаления
			ИЛИ ВыборкаДетальныеЗаписи.ПрограммаЦелевойСтатьиКРБПометкаУдаления
			ИЛИ ВыборкаДетальныеЗаписи.ВидРасходаКРБПометкаУдаления
			ИЛИ ВыборкаДетальныеЗаписи.СтатьяКИФПометкаУдаления 
			ИЛИ ВыборкаДетальныеЗаписи.ВидДоходаКДБПометкаУдаления Тогда
			
			СпрКБКОбъект.ПометкаУдаления = Истина;
		КонецЕсли;
		
		
		Попытка
			СпрКБКОбъект.Записать();
			Если ИзмененПериодДействия И ЗначениеЗаполнено(СпрКБКОбъект[СтруктураПараметров.ДатаНачалаДействия]) Тогда
				Справочники[СтруктураПараметров.ИмяКПС].АктуализироватьРабочиеСчета(СпрКБКОбъект.Ссылка, СпрКБКОбъект[СтруктураПараметров.ДатаНачалаДействия], СпрКБКОбъект[СтруктураПараметров.ДатаОкончанияДействия], СпрКБКОбъект[СтруктураПараметров.ОкончаниеДействия]);
			КонецЕсли;
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось актуализировать КПС с кодом %1. " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке())+"'"), СпрКБКОбъект[СтруктураПараметров.Код]);			
			НовСтр = ТаблицаОшибок.Добавить();
			НовСтр.ЗагружаемыеДанные = "Актуализация КПС";
			НовСтр.ИмяОбъекта = "Классификационные признаки счетов (КПС)";
			НовСтр.ОписаниеОшибки = ТекстСообщения;
			НовСтр.СсылкаНаЭлементОшибки = СпрКБКОбъект.Ссылка;
		КонецПопытки;
		
	КонецЦикла;
	
	СтруктураРезультата = Новый Структура("ТаблицаОшибок,ТаблицаИнформации", ТаблицаОшибок, ТаблицаИнформации);
	ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресВХранилище);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПериодДействияПоОбщемуПериодуДействияКомпонентов(Знач ИменаРеквизитов, СпрКБКОбъект, Выборка, ТаблицаИнформации, СтруктураПараметров)
	
	ТекДатаНачала    = СпрКБКОбъект[СтруктураПараметров.ДатаНачалаДействия];
	ТекДатаОкончания = '29990101';
	
	Для Каждого ИмяРеквизита Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаРеквизитов) Цикл
		
		ЗначениеРеквизита = СпрКБКОбъект[ИмяРеквизита];
		
		Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			ТекДатаНачала    = Макс(ТекДатаНачала,    Выборка[ИмяРеквизита+"ДатаНачалаДействия"]);
			ТекДатаОкончания = Мин (ТекДатаОкончания, Выборка[ИмяРеквизита+"ДатаОкончанияДействия"]);
		КонецЕсли;
		
		Если ТекДатаНачала > ТекДатаОкончания Тогда
			СпрКБКОбъект.ПометкаУдаления = Истина;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Компоненты КБК с кодом %1 имеют непересекающиеся периоды действия (%2). Помечен на удаление.'"),СпрКБКОбъект.Наименование,ИмяРеквизита);
			
			НовСтр = ТаблицаИнформации.Добавить();
			НовСтр.ЗагружаемыеДанные = "Актуализация КПС";
			НовСтр.ИмяОбъекта = "Классификационные признаки счетов (КПС)";
			НовСтр.ОписаниеОшибки = ТекстСообщения;
			НовСтр.СсылкаНаЭлементОшибки = СпрКБКОбъект.Ссылка;
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекДатаНачала <= ТекДатаОкончания Тогда
		
		СпрКБКОбъект[СтруктураПараметров.ДатаНачалаДействия] = ТекДатаНачала;
		
		Если ЗначениеЗаполнено(СпрКБКОбъект[СтруктураПараметров.ОкончаниеДействия]) Тогда
			СпрКБКОбъект[СтруктураПараметров.ОкончаниеДействия] = ?(ТекДатаОкончания = '29990101', 
																	Макс(СпрКБКОбъект[СтруктураПараметров.ОкончаниеДействия], ТекДатаНачала), 
																	Макс(Мин(ТекДатаОкончания, СпрКБКОбъект[СтруктураПараметров.ОкончаниеДействия]), ТекДатаНачала));
		Иначе
			СпрКБКОбъект[СтруктураПараметров.ОкончаниеДействия]  = ?(ТекДатаОкончания = '29990101', '00010101', ТекДатаОкончания);
		КонецЕсли;
	Иначе
		СпрКБКОбъект[СтруктураПараметров.ДатаНачалаДействия] = '00010101';
		СпрКБКОбъект[СтруктураПараметров.ОкончаниеДействия]  = '00010101';
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
